bundles/org.openhab.binding.ihc/src/test/resources/GetSystemInfoResponse2.xml

<SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getSystemInfo1 xmlns:ns1="utcs" xsi:type="ns1:WSSystemInfo">
<ns1:uptime xsi:type="xsd:long">164057634</ns1:uptime>

<ns1:realtimeclock xsi:type="xsd:dateTime">2018-12-15T13:15:00Z</ns1:realtimeclock>

<ns1:serialNumber xsi:type="xsd:string">CN1734000000</ns1:serialNumber>

<ns1:productionDate xsi:type="xsd:string">2017/34</ns1:productionDate>

<ns1:brand xsi:type="xsd:string">LK</ns1:brand>

<ns1:version xsi:type="xsd:string">3.3.9</ns1:version>

<ns1:hwRevision xsi:type="xsd:string">7.1</ns1:hwRevision>

<ns1:swDate xsi:type="xsd:dateTime">2018-07-23T10:00:00Z</ns1:swDate>

<ns1:datalineVersion xsi:type="xsd:string">IOB.B.03.02.01</ns1:datalineVersion>

<ns1:rfModuleSoftwareVersion xsi:type="xsd:string">3.06.c</ns1:rfModuleSoftwareVersion>

<ns1:rfModuleSerialNumber xsi:type="xsd:string">640C10140000</ns1:rfModuleSerialNumber>

<ns1:applicationIsWithoutViewer xsi:type="xsd:boolean">false</ns1:applicationIsWithoutViewer>
</ns1:getSystemInfo1>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
